In [1]:
import numpy as np
import pandas as pd

data = [
    ['Andi', 'Jakarta', 'PNS'],
    ['Budi', 'Jakarta', 'Karyawan'],
    ['Caca', 'Jakarta', 'IRT']
]

dData = pd.DataFrame(
    data,
    index = list('xyz'),
    columns = ['Nama', 'Kota', 'Pekerjaan']
)
dData

   Nama     Kota Pekerjaan
x  Andi  Jakarta       PNS
y  Budi  Jakarta  Karyawan
z  Caca  Jakarta       IRT

In [2]:
data = {
    'x': [123,321,213],
    'y': [234,432,324],
    'z': [345,543,435]
}
df = pd.DataFrame(data)
df

     x    y    z
0  123  234  345
1  321  432  543
2  213  324  435

In [3]:
data = [
    {'nama': 'Andi', 'kota': 'Jakarta'},
    {'nama': 'Andi', 'kota': 'Jakarta'},
    {'nama': 'Andi', 'kota': 'Jakarta'},
    {'nama': 'Andi', 'kota': 'Jakarta', 'job': 'PNS'}
]
# Muncul NaN pada kolom job yg artinya 'Not a Number'
df = pd.DataFrame(data)
df

   nama     kota  job
0  Andi  Jakarta  NaN
1  Andi  Jakarta  NaN
2  Andi  Jakarta  NaN
3  Andi  Jakarta  PNS

In [4]:
# Memasukkan 'Series' ke dalam 'DataFrame'

x  = [1,2,3,4,5]
x  = pd.Series(x, name='Test')
y  = [5,4,3,2,1]
y  = pd.Series(y, name='Try')

df = pd.DataFrame({
    x.name: x,
    y.name: y
})
df

   Test  Try
0     1    5
1     2    4
2     3    3
3     4    2
4     5    1

In [5]:
# Merubah 'name' dari kolom

df = pd.DataFrame({
    'Col.X': x,
    'Col.Y': y
})
df

   Col.X  Col.Y
0      1      5
1      2      4
2      3      3
3      4      2
4      5      1

In [6]:
df = pd.DataFrame({
    'A': np.arange(20, 26),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
}, index = list('abcdef'))
df

    A   B         C    D
a  20  32  0.974342  1.0
b  21   4  0.921472  1.0
c  22  12  0.851561  1.0
d  23  54  0.634273  1.0
e  24  21  0.224899  1.0
f  25  18  0.616978  1.0

In [7]:
df.head(3)           #Keluar 3 data pertama

    A   B         C    D
a  20  32  0.974342  1.0
b  21   4  0.921472  1.0
c  22  12  0.851561  1.0

In [8]:
df.tail(2)           #Keluar 2 data terakhir

    A   B         C    D
e  24  21  0.224899  1.0
f  25  18  0.616978  1.0

In [9]:
list(df.index)

['a', 'b', 'c', 'd', 'e', 'f']

In [10]:
list(df.columns)

['A', 'B', 'C', 'D']

In [11]:
df.values

array([[20.        , 32.        ,  0.97434166,  1.        ],
       [21.        ,  4.        ,  0.92147157,  1.        ],
       [22.        , 12.        ,  0.85156066,  1.        ],
       [23.        , 54.        ,  0.63427312,  1.        ],
       [24.        , 21.        ,  0.22489941,  1.        ],
       [25.        , 18.        ,  0.61697811,  1.        ]])

In [12]:
df.describe()

               A          B         C    D
count   6.000000   6.000000  6.000000  6.0
mean   22.500000  23.500000  0.703921  1.0
std     1.870829  17.615334  0.277173  0.0
min    20.000000   4.000000  0.224899  1.0
25%    21.250000  13.500000  0.621302  1.0
50%    22.500000  19.500000  0.742917  1.0
75%    23.750000  29.250000  0.903994  1.0
max    25.000000  54.000000  0.974342  1.0

In [13]:
df['A'].values

array([20, 21, 22, 23, 24, 25])

In [14]:
df['A'].describe()

count     6.000000
mean     22.500000
std       1.870829
min      20.000000
25%      21.250000
50%      22.500000
75%      23.750000
max      25.000000
Name: A, dtype: float64

In [15]:
df.sort_index(ascending=False, axis=0)     # Axis=0, Mengurutkan descending index baris

    A   B         C    D
f  25  18  0.616978  1.0
e  24  21  0.224899  1.0
d  23  54  0.634273  1.0
c  22  12  0.851561  1.0
b  21   4  0.921472  1.0
a  20  32  0.974342  1.0

In [16]:
df.sort_index(ascending=False, axis=1)      # Axis=1, Mengurutkan descending index kolom

     D         C   B   A
a  1.0  0.974342  32  20
b  1.0  0.921472   4  21
c  1.0  0.851561  12  22
d  1.0  0.634273  54  23
e  1.0  0.224899  21  24
f  1.0  0.616978  18  25

In [17]:
df.sort_values(by='C', ascending=False)     # Mengurut berdasarkan data di kolom 'C'

    A   B         C    D
a  20  32  0.974342  1.0
b  21   4  0.921472  1.0
c  22  12  0.851561  1.0
d  23  54  0.634273  1.0
f  25  18  0.616978  1.0
e  24  21  0.224899  1.0

In [18]:
# Mengurutkan berdasarkan 2 data dan berbeda urutan

df = pd.DataFrame({
    'A': np.array([20, 20, 21, 25, 26, 26]),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
}, index = list('abcdef'))

df.sort_values(by=['A','B'], ascending=[False,True])

    A   B         C    D
f  26  18  0.237260  1.0
e  26  21  0.372782  1.0
d  25  54  0.351493  1.0
c  21  12  0.504340  1.0
b  20   4  0.090250  1.0
a  20  32  0.755567  1.0

In [19]:
df[0:2]     # Menampilkan semua kolom tapi hanya 2 index (baris)

    A   B         C    D
a  20  32  0.755567  1.0
b  20   4  0.090250  1.0

In [20]:
df[::2]     # Menampilkan data dengan loncat 2 pada index (baris)

    A   B         C    D
a  20  32  0.755567  1.0
c  21  12  0.504340  1.0
e  26  21  0.372782  1.0

In [21]:
df.loc['a', ['B','D']]     # Menampilkan baris 1, hanya kolom B dan D
                           # Nama baris harus sesuai 'index' pada data

B    32.0
D     1.0
Name: a, dtype: float64

In [22]:
# 
df = pd.DataFrame({
    'A': np.array([20, 20, 21, 25, 26, 26]),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
},)
df

    A   B         C    D
0  20  32  0.471616  1.0
1  20   4  0.082517  1.0
2  21  12  0.764474  1.0
3  25  54  0.918586  1.0
4  26  21  0.246010  1.0
5  26  18  0.669155  1.0

In [23]:
# Penggunaan 'iloc'
df.index = list('abcdef')
df.iloc[3:5, 0:3]                # Memanggil berdasarkan urutan [index, kolom]
                                 # Urutan index harus bentuk 'int'

    A   B         C
d  25  54  0.918586
e  26  21  0.246010

In [24]:
# df.index = df['A']        # Menjadikan kolom A menjadi index tapi A tetep ada di dalam konten
# df

In [25]:
# df = df.set_index('A')     # Menjadikan salah satu kolom menjadi index baris
# df

In [26]:
# df.index  = list('abcdef')
# df.colums = ['Nama', 'Nilai', 'Value', 'Ranking']

In [27]:
df.iloc[::2].sort_values(
    by = ['B','C'],
    ascending = [False, True]
)[['B', 'C']]

    B         C
a  32  0.471616
e  21  0.246010
c  12  0.764474

In [28]:
mydf = pd.read_csv('data.csv')
mydf

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi  Bandung
2   3  Caca    Medan
3   4  Doni    Bogor

In [29]:
myexcel = pd.read_excel('data.xlsx')
myexcel

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi  Bandung
2   3  Caca    Bogor

In [31]:
myjson = pd.read_json('data.json')
myjson[['nama', 'kota']]

   nama       kota
0  Andi    Jakarta
1  Budi  Palembang
2  Caca   Surabaya

In [ ]:
# Coba bikin dataframe:
# Dari file .csv .xlsx .json tanpa 'pandas'